In [17]:
import pandas as pd

In [18]:
data = {
    "ID": [1, 2, None, 4, 5, 6, None, 8, 9, 10,
           11, None, 13, 14, 15, None, 17, 18, 19, 20,
           None, 22, 23, 24, None, 26, 27, 28, 29, None,
           31, 32, None, 34, 35, 36, None, 38, 39, 40,
           41, None, 43, 44, 45, None, 47, 48, 49, 50],

    "Name": [" John ", "mary", "ANNA!!", "peter", None,
             " Sam  ", "miCHAEL", "linda ", "##james", "sAraH ",
             " Mike", "   ", "JoHN", "MARY!!", " anna ",
             "PeTer", "unknown", "Sam", "LiNdA", "James",
             "Sarah", "MIKE", None, "m ary", "john  ",
             "Mary", "ann@", "pete r", "Linda", "###James",
             "SARAH", "Mi ke", "J0hn", "Mar y", "Ann a",
             "Peterrr", "Sammm", "Lin da", "James!", "Saarah",
             " mike ", "Maryy", "Annaa", "Peter__", "Li nda ",
             "JAMES", "Sarahh", None, "   Linda  ", "??Mike"],

    "Age": [25, "32", "Twenty", -5, None,
            30, "?", 45, 60, 18,
            200, 30, 25, "?", "Thirty",
            None, -10, 45, 61, "??",
            "20 years", 29, 33, 18, 22,
            "forty", 19, None, -3, "N/A",
            40, "??", 60, 55, -100,
            "Unknown", 45, 36, 29, "??",
            21, 30, None, "?", "thirty-five",
            90, "200", "??", -1, 27],

    "Gender": ["M", "F", "Male", "Female", "unknown",
               " ", None, "M", "F", "male",
               "female", "Unknown", "m", "f", "MALE",
               "FEMALE", "mAle", "FemAle", "f", "uNkNowN",
               "M ", " F", "Unknown", "", " ",
               "Female", "Male", "f", "m", None,
               "Unknown", "male", "female", "M", "F",
               "unknown", "M", "F", " ", "Male",
               "Female", "unknown", "MALE", "FEMALE", "m",
               "f", "M", "F", "unknown", " "],

    "Date_Joined": ["2020-01-05", "01/05/2020", "2020/13/05", None, "5 Jan 2020",
                    "2021-07-32", "2022-03-15", "2020-01-05", "01-05-2020", "2020-05-01",
                    "2020-31-01", "2021/02/29", "2019-12-12", "12/31/2019", None,
                    "2020-14-05", "2022-11-30", "15/03/2021", "2021-04-31", "2018/07/25",
                    "July 5, 2020", "2021-02-28", None, "2019-25-12", "2020/00/10",
                    "2017-06-15", "2020-09-31", "03/15/2022", "2022-13-01", "2020-01-32",
                    "2021-05-10", None, "2020-02-29", "2020-04-31", "2020/05/20",
                    "13/13/2020", "2019-07-07", "07/25/2020", "2020-00-00", "2021-10-10",
                    "2018-12-31", "2017-01-01", "2016-02-30", "2015-11-11", None,
                    "2022-05-20", "20/05/2022", "2021-06-31", "2020-07-15", "01/32/2021"],

    "Salary": [2000, "3,000", "$4000", None, "Five Thousand",
               1000000, 3500, "4O00", "2,500", "£3000",
               "USD 4500", "N5000", "€6000", "seven thousand", "8000",
               "9000.50", "10000", "??", " ", "0",
               "3500", " 4000", "$$$5000", "ten thousand", None,
               "4500", "3,200", "5000.00", "N/A", "-2000",
               "6000", "7000", "??", "10000000", "One Million",
               "2500", "£4000", "3000", "400O", "9999999",
               "200", "30,000", "?", "NaN", None,
               "7500", "8,000", "four thousand", "500", "100"]
}

In [19]:
#convert this dictionary to DataFrame (df)
df = pd.DataFrame(data)

In [20]:
#Using Dictionary format
Word2fig = {
     'Five Thousand': '5000',
     'seven thousand': '7000',
     'ten thousand': '10000',
     'One Million': '1000000',
     'four thousand':'4000',
     '400O':'4000',
     '4O00': '4000',
     '-2000':'2000'
 }
df['Salary'] = df['Salary'].replace(Word2fig)
df['Salary']

0         2000
1        3,000
2        $4000
3         None
4         5000
5      1000000
6         3500
7         4000
8        2,500
9        £3000
10    USD 4500
11       N5000
12       €6000
13        7000
14        8000
15     9000.50
16       10000
17          ??
18
19           0
20        3500
21        4000
22     $$$5000
23       10000
24        None
25        4500
26       3,200
27     5000.00
28         N/A
29        2000
30        6000
31        7000
32          ??
33    10000000
34     1000000
35        2500
36       £4000
37        3000
38        4000
39     9999999
40         200
41      30,000
42           ?
43         NaN
44        None
45        7500
46       8,000
47        4000
48         500
49         100
Name: Salary, dtype: object

In [21]:
df['Salary'].astype(str).str.replace('[^0-9-.]', '', regex = True)

0         2000
1         3000
2         4000
3
4         5000
5      1000000
6         3500
7         4000
8         2500
9         3000
10        4500
11        5000
12        6000
13        7000
14        8000
15     9000.50
16       10000
17
18
19           0
20        3500
21        4000
22        5000
23       10000
24
25        4500
26        3200
27     5000.00
28
29        2000
30        6000
31        7000
32
33    10000000
34     1000000
35        2500
36        4000
37        3000
38        4000
39     9999999
40         200
41       30000
42
43
44
45        7500
46        8000
47        4000
48         500
49         100
Name: Salary, dtype: object

In [22]:
df['Salary'] = pd.to_numeric(df['Salary'], errors ='coerce')
df['Salary']

0         2000.0
1            NaN
2            NaN
3            NaN
4         5000.0
5      1000000.0
6         3500.0
7         4000.0
8            NaN
9            NaN
10           NaN
11           NaN
12           NaN
13        7000.0
14        8000.0
15        9000.5
16       10000.0
17           NaN
18           NaN
19           0.0
20        3500.0
21        4000.0
22           NaN
23       10000.0
24           NaN
25        4500.0
26           NaN
27        5000.0
28           NaN
29        2000.0
30        6000.0
31        7000.0
32           NaN
33    10000000.0
34     1000000.0
35        2500.0
36           NaN
37        3000.0
38        4000.0
39     9999999.0
40         200.0
41           NaN
42           NaN
43           NaN
44           NaN
45        7500.0
46           NaN
47        4000.0
48         500.0
49         100.0
Name: Salary, dtype: float64

In [23]:
Median_Salary = df['Salary'].median()
Median_Salary

4500.0

In [24]:
Mean_Salary = df['Salary'].mean()
Mean_Salary

762493.0862068966

In [25]:
Mode_Salary = df['Salary'].mode()
Mode_Salary

0    4000.0
Name: Salary, dtype: float64

In [13]:
df['Salary'] = df['Salary'].fillna(Median_Salary)
df['Salary']

0         2000.0
1         4500.0
2         4500.0
3         4500.0
4         5000.0
5      1000000.0
6         3500.0
7         4000.0
8         4500.0
9         4500.0
10        4500.0
11        4500.0
12        4500.0
13        7000.0
14        8000.0
15        9000.5
16       10000.0
17        4500.0
18        4500.0
19           0.0
20        3500.0
21        4000.0
22        4500.0
23       10000.0
24        4500.0
25        4500.0
26        4500.0
27        5000.0
28        4500.0
29        2000.0
30        6000.0
31        7000.0
32        4500.0
33    10000000.0
34     1000000.0
35        2500.0
36        4500.0
37        3000.0
38        4000.0
39     9999999.0
40         200.0
41        4500.0
42        4500.0
43        4500.0
44        4500.0
45        7500.0
46        4500.0
47        4000.0
48         500.0
49         100.0
Name: Salary, dtype: float64

In [14]:
#Use this where there is are more than one modes 
Mode_Salary = df['Salary'].mode()[0]
Mode_Salary

4500.0